docs/my-personal-zettelkasten-workflow.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-18 Thu 13:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My personal zettelkasten workflow</title>
<meta name="author" content="Roger Farrell" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="template/styles.css" type="text/css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">My personal zettelkasten workflow</h1>
<div id="outline-container-real-time-idea-capture" class="outline-2">
<h2 id="real-time-idea-capture">Real time idea capture</h2>
<div class="outline-text-2" id="text-real-time-idea-capture">
<p>
I find that I am rarely ready to take a note when the idea first
strikes. The first encounter is messy. It takes time and some digestion
for the idea to take shape and start to show how it is connected to
other related ideas. During this period, I try to make an entry in
<a href="references/learning-log.html">references/learning-log.html</a>. Logging the thought prevents it from
being lost forever. Once an idea has become sufficiently mature to write
about, I write an initial note in my inbox folder. The note will stay
here until two conditions are met:
</p>

<ul class="org-ul">
<li>The idea has been clearly represented in a way that is compliant with
my note taking conventions and is accessible to my future self.</li>
<li>I have linked to the note from at least one pre-existing note.</li>
</ul>
</div>
</div>
<div id="outline-container-navigating-my-notes" class="outline-2">
<h2 id="navigating-my-notes">Navigating my notes</h2>
<div class="outline-text-2" id="text-navigating-my-notes">
<p>
The zettelkasten method yields a web of hyperlinked notes. A strategy
for creating entry points into this web is essential to efficient
navigation as memory fades. Many people employ the folgezettel
schema<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> for this purpose. However, I have chosen to do this via
structure (or hub) notes.
</p>

<p>
Structure notes are constituted of hierarchical lists of other notes
mapped by a given topic. I will be using tags to implement this feature
as can be found in my <a href="taking-notes-in-vim.html">note-taking
workflow</a>. At the time of creation, every note will be linked to at
least one structure note. Structure notes must be linked to at least one
other structure note or my registry: <a href="index.html">index.html</a>.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
The folgezettel schema is an efficient way to define hierarchical
IDs for notes in
real-time:<a href="references/the-great-folgezettel-debate.html">references/the-great-folgezettel-debate.html</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Roger Farrell</p>
<p class="date">Created: 2025-09-18 Thu 13:51</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
